---
kind: other
id: Properties.T:Autodesk.Revit.DB.CitySetIterator
source: html/1ee00860-a75a-71cf-01b5-87bf6c3db19f.htm
---
# CitySetIterator Properties

Retrieves the item that is the current focus of the iterator.